app/controllers/products_controller.rb

SELECT "products".* FROM "products"   ORDER BY created_at DESC
---
  def index
    if params[:search]
      @products = Product.search(params[:search]).order("created_at DESC")

SELECT "productsreviews".* FROM "productsreviews"
---
  def show
    @products = Product.all
    @productsreview = Productsreviews.all

INSERT INTO "products" ("brand", "created_at", "description", "name", "price", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @product = Product.new(product_params)
    respond_to do |format|
      if @product.save

SELECT  "products".* FROM "products"  WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "productsreviews" SET "description" = ?, "updated_at" = ? WHERE "productsreviews"."id" = 1  [["description", "lets see"], ["updated_at", "2014-11-06 04:43:40.987249"]]
---
  def create_review
    @review = Productsreviews.new
    @product = Product.find(params[:product_id])
    if @review.update_attribute(:title, params[:review][:title])
      if @review.update_attribute(:description, params[:review][:description])
        if @review.update_attribute(:product_id, @product.id)

SELECT  "products".* FROM "products"  WHERE "products"."id" = ? LIMIT 1  [["id", "all"]]
---
    def set_product
      begin
        @product = Product.find(params[:id])