app/controllers/sessions_controller.rb

  def create
    auth = request.env["omniauth.auth"]
    user = User.where(:provider => auth['provider'],
                      :uid => auth['uid'].to_s).first || User.create_with_omniauth(auth)
---
INSERT INTO "users" ("created_at", "name", "provider", "uid", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-11-05 17:22:16.391572"], ["name", "Sahil Shekhawat"], ["provider", "google_oauth2"], ["uid", "118350975817366064714"], ["updated_at", "2014-11-05 17:22:16.391572"]]
SELECT  "users".* FROM "users"  WHERE "users"."provider" = 'google_oauth2' AND "users"."uid" = '118350975817366064714'  ORDER BY "users"."id" ASC LIMIT 1