app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @reviews = Reviews.all
    @products = Product.all
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "reviews".* FROM "reviews"
SELECT "products".* FROM "products"

  def update
    @user = User.find(params[:id])
    if @user.update_attribute(:location , params[:user][:location])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "company_name" = ?, "updated_at" = ? WHERE "users"."id" = 3  [["company_name", "Backpack labs"], ["updated_at", "2014-11-05 21:11:28.638707"]]

  def create
    @review = Reviews.new
    @user = User.find(params[:user_id])
    if @review.update_attribute(:title, params[:review][:title])
      if @review.update_attribute(:description, params[:review][:description])
        if @review.update_attribute(:user_id, @user.id)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "reviews" SET "description" = ?, "updated_at" = ? WHERE "reviews"."id" = 2  [["description", "This is bad"], ["updated_at", "2014-11-06 03:23:04.852593"]]